Catalogs/АК_НоминалыДенежныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АК_НоминалыДенежныхЕдиниц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоВМешке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоличествоВМешкеПоИнкассаторам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнкассируемыйБанк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантШаблона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВМешке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АК_НоминалыДенежныхЕдиниц/Ext/ManagerModule.bsl
Функция КоличествоВМешке(Ссылка,Номинал) Экспорт 

	КоличествоВМешке = Номинал.КоличествоВМешке;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.БанкВносительИнкассация КАК БанкВноситель,
	|	СтруктурныеЕдиницы.БанкВносительИнкассация.Город КАК ГородБанка,
	|	СтруктурныеЕдиницы.ИнкассируемыйБанк  КАК ИнкассируемыйБанк
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Отбор = Новый Структура();
		Отбор.Вставить("ИнкассируемыйБанк",Выборка.ИнкассируемыйБанк);
		
		Если ЗначениеЗаполнено(Выборка.БанкВноситель) и Выборка.ГородБанка <> "Г. МОСКВА" Тогда 
			Отбор.Вставить("ВариантШаблона","Регион");
		Иначе 
			Отбор.Вставить("ВариантШаблона","");
		КонецЕсли;
		
		
		РезПоискаКаталога = Номинал.КоличествоВМешкеПоИнкассаторам.НайтиСтроки(Отбор);
		Если РезПоискаКаталога.Количество() <> 0 Тогда
			КоличествоВМешке = РезПоискаКаталога[0].КоличествоВМешке;
		КонецЕсли; 	
	Конецесли;
	
	
	
Возврат КоличествоВМешке;
КонецФункции // ()
